zhengjy926/bsp/stm32/hal/bsp_usart.c
/**
  ******************************************************************************
  * @copyright   : Copyright To Hangzhou Dinova EP Technology Co.,Ltd
  * @file        : bsp_usart.c
  * @author      : ZJY
  * @version     : V1.0
  * @date        : 2025-10-16
  * @brief       : STM32 USART driver implementation
  * @attention   : None
  ******************************************************************************
  * @history     :
  *         V1.0 : 1.Initial version
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "bsp_usart.h"
#include "bsp_conf.h"
#include "bsp_dma.h"
#include "serial.h"
#include "errno-base.h"
#include <stdio.h>

#define  LOG_TAG             "bsp_uart"
#define  LOG_LVL             4
#include "log.h"

#if defined(HAL_UART_MODULE_ENABLED)

/* Private typedef -----------------------------------------------------------*/
struct stm32_uart {
    UART_HandleTypeDef huart;
    USART_TypeDef *Instance;
    DMA_HandleTypeDef hdma_uart_rx;
    DMA_HandleTypeDef hdma_uart_tx;
    char *name;
    uint8_t *rx_cache_buf;
    uint16_t rx_cache_bufsz;
    uint16_t last_pos;
    uint8_t index;
};

/* Private define ------------------------------------------------------------*/
enum
{
#ifdef BSP_USING_UART1
    UART1_INDEX,
#endif

#ifdef BSP_USING_UART2
    UART2_INDEX,
#endif

#ifdef BSP_USING_UART3
    UART3_INDEX,
#endif

#ifdef BSP_USING_UART4
    UART4_INDEX,
#endif

#ifdef BSP_USING_UART5
    UART5_INDEX,
#endif

#ifdef BSP_USING_UART6
    UART6_INDEX,
#endif

#ifdef BSP_USING_UART7
    UART7_INDEX,
#endif

#ifdef BSP_USING_UART8
    UART8_INDEX,
#endif

#ifdef BSP_USING_LPUART1
    LPUART1_INDEX,
#endif
    UART_INDEX_MAX,
};

/* Private variables ---------------------------------------------------------*/
static serial_t serial_dev[UART_INDEX_MAX]; /* 串口设备数组 */

/* 串口缓冲区定义 */
#if defined(BSP_USING_UART1)
    static uint8_t uart1_rx_buf[UART1_RX_BUF_SIZE]         = {0};
    static uint8_t uart1_tx_buf[UART1_TX_BUF_SIZE]         = {0};
    static uint8_t uart1_rx_cache_buf[UART1_RX_CACHE_BUF_SIZE] = {0};
#endif // BSP_USING_UART1

#if defined(BSP_USING_UART2)
    static uint8_t uart2_rx_buf[UART2_RX_BUF_SIZE]              = {0};
    static uint8_t uart2_tx_buf[UART2_TX_BUF_SIZE]              = {0};
    static uint8_t uart2_rx_cache_buf[UART2_RX_CACHE_BUF_SIZE]     = {0};
#endif // BSP_USING_UART2

#if defined(BSP_USING_UART3)
    static uint8_t uart3_rx_buf[UART3_RX_BUF_SIZE]              = {0};
    static uint8_t uart3_tx_buf[UART3_TX_BUF_SIZE]              = {0};
    static uint8_t uart3_rx_cache_buf[UART3_RX_CACHE_BUF_SIZE]     = {0};
#endif // BSP_USING_UART3

#if defined(BSP_USING_UART4)
    static uint8_t uart4_rx_buf[UART4_RX_BUF_SIZE]              = {0};
    static uint8_t uart4_tx_buf[UART4_TX_BUF_SIZE]              = {0};
    static uint8_t uart4_rx_cache_buf[UART4_RX_CACHE_BUF_SIZE]     = {0};
#endif // BSP_USING_UART4

#if defined(BSP_USING_UART5)
    static uint8_t uart5_rx_buf[UART5_RX_BUF_SIZE]              = {0};
    static uint8_t uart5_tx_buf[UART5_TX_BUF_SIZE]              = {0};
    static uint8_t uart5_rx_cache_buf[UART5_RX_CACHE_BUF_SIZE]     = {0};
#endif // BSP_USING_UART5

#if defined(BSP_USING_UART6)
    static uint8_t uart6_rx_buf[UART6_RX_BUF_SIZE]              = {0};
    static uint8_t uart6_tx_buf[UART6_TX_BUF_SIZE]              = {0};
    static uint8_t uart6_rx_cache_buf[UART6_RX_CACHE_BUF_SIZE]     = {0};
#endif // BSP_USING_UART6

#if defined(BSP_USING_UART7)
    static uint8_t uart7_rx_buf[UART7_RX_BUF_SIZE]              = {0};
    static uint8_t uart7_tx_buf[UART7_TX_BUF_SIZE]              = {0};
    static uint8_t uart7_rx_cache_buf[UART7_RX_CACHE_BUF_SIZE]     = {0};
#endif // BSP_USING_UART7

#if defined(BSP_USING_UART8)
    static uint8_t uart8_rx_buf[UART8_RX_BUF_SIZE]              = {0};
    static uint8_t uart8_tx_buf[UART8_TX_BUF_SIZE]              = {0};
    static uint8_t uart8_rx_cache_buf[UART8_RX_CACHE_BUF_SIZE]     = {0};
#endif // BSP_USING_UART8

#if defined(BSP_USING_LPUART1)
    static uint8_t lpuart1_rx_buf[LPUART1_RX_BUF_SIZE]          = {0};
    static uint8_t lpuart1_tx_buf[LPUART1_TX_BUF_SIZE]          = {0};
    static uint8_t lpuart1_rx_cache_buf[LPUART1_RX_CACHE_BUF_SIZE] = {0};
#endif // BSP_USING_LPUART1

/* 平台专有驱动结构体变量定义 */
static struct stm32_uart stm_uart_drv[UART_INDEX_MAX] =
{
#ifdef BSP_USING_UART1
    {
        .Instance = USART1,
        .rx_cache_buf = uart1_rx_cache_buf,
        .rx_cache_bufsz = UART1_RX_CACHE_BUF_SIZE,
        .index = UART1_INDEX,
        .name = "uart1",
    },
#endif

#ifdef BSP_USING_UART2
    {
        .Instance = USART2,
        .rx_cache_buf = uart2_rx_cache_buf,
        .rx_cache_bufsz = UART2_RX_CACHE_BUF_SIZE,
        .index = UART2_INDEX,
        .name = "uart2",
    },
#endif

#ifdef BSP_USING_UART3
    {
        .Instance = USART3,
        .rx_cache_buf = uart3_rx_cache_buf,
        .rx_cache_bufsz = UART3_RX_CACHE_BUF_SIZE,
        .index = UART3_INDEX,
        .name = "uart3",
    },
#endif

#ifdef BSP_USING_UART4
    {
        .Instance = UART4,
        .rx_cache_buf = uart4_rx_cache_buf,
        .rx_cache_bufsz = UART4_RX_CACHE_BUF_SIZE,
        .index = UART4_INDEX,
        .name = "uart4",
    },
#endif
#ifdef BSP_USING_UART5
    {
        .Instance = UART5,
        .rx_cache_buf = uart5_rx_cache_buf,
        .rx_cache_bufsz = UART5_RX_CACHE_BUF_SIZE,
        .index = UART5_INDEX,
        .name = "uart5",
    },
#endif
#ifdef BSP_USING_UART6
    {
        .Instance = UART6,
        .rx_cache_buf = uart6_rx_cache_buf,
        .rx_cache_bufsz = UART6_RX_CACHE_BUF_SIZE,
        .index = UART6_INDEX,
        .name = "uart6",
    },
#endif
#ifdef BSP_USING_UART7
    {
        .Instance = UART7,
        .rx_cache_buf = uart7_rx_cache_buf,
        .rx_cache_bufsz = UART7_RX_CACHE_BUF_SIZE,
        .index = UART7_INDEX,
        .name = "uart7",
    },
#endif
#ifdef BSP_USING_UART8
    {
        .Instance = UART8,
        .rx_cache_buf = uart8_rx_cache_buf,
        .rx_cache_bufsz = UART8_RX_CACHE_BUF_SIZE,
        .index = UART8_INDEX,
        .name = "uart8",
    },
#endif
#ifdef BSP_USING_LPUART1
    {
        .Instance = LPUART1,
        .rx_cache_buf = lpuart1_rx_cache_buf,
        .rx_cache_bufsz = LPUART1_RX_CACHE_BUF_SIZE,
        .index = LPUART1_INDEX,
        .name = "lpuart1",
    },
#endif
};

/* Function prototypes */
static int stm32_usart_init(serial_t *port);
static int stm32_uart_tx(serial_t *port, const void *buf, size_t size);
static int stm32_uart_start_rx(serial_t *port);
static int stm32_uart_configure(serial_t *port, struct serial_configure *cfg);
static void stm32_uart_gpio_init(struct stm32_uart *uartHandle);
static void stm32_uart_dma_config(struct stm32_uart *uartHandle);
static bool stm32_uart_tx_is_busy(struct serial *port);

/* Serial operations structure */
static const serial_ops_t stm_uart_ops = {
    .init = stm32_usart_init,
    .send = stm32_uart_tx,
    .configure = stm32_uart_configure,
    .start_rx = stm32_uart_start_rx,
    .tx_is_busy = stm32_uart_tx_is_busy,
};

