zhengjy926/bsp/stm32/hal/bsp_usart.c
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/**
  * @brief  STM32 USART initialization function
  * @param  port: Pointer to serial device
  * @retval 0 on success, negative error code on failure
  */
static int stm32_usart_init(serial_t *port)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;
    int ret = 0;

    stm32_uart_gpio_init(stm_uart);
    stm32_uart_dma_config(stm_uart);

    /* Initialize port configuration with default values */
    struct serial_configure cfg = SERIAL_CONFIG_DEFAULT;
    port->config = cfg;

    /* Configure UART handle */
    stm_uart->huart.Instance = stm_uart->Instance;
    stm_uart->huart.Init.Mode = UART_MODE_TX_RX;
    stm_uart->huart.Init.OverSampling = UART_OVERSAMPLING_16;
#if defined(STM32G4)
    stm_uart->huart.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    stm_uart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    stm_uart->huart.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
#endif

    ret = stm32_uart_configure(port, &cfg);
    if (ret != 0)
        return ret;

#if defined(STM32G4)
    /* Configure FIFO thresholds for STM32G4 series */
    if (HAL_UARTEx_SetTxFifoThreshold(&stm_uart->huart, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK) {
        return -EIO;
    }
    if (HAL_UARTEx_SetRxFifoThreshold(&stm_uart->huart, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK) {
        return -EIO;
    }
    if (HAL_UARTEx_DisableFifoMode(&stm_uart->huart) != HAL_OK) {
        return -EIO;
    }
#endif
    stm32_uart_start_rx(port);
    return 0;
}

/**
  * @brief  Configure UART parameters
  * @param  port: Pointer to serial device
  * @param  cfg: Pointer to configuration structure
  * @retval 0 on success, negative error code on failure
  */
static int stm32_uart_configure(serial_t *port, struct serial_configure *cfg)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;

    if (!port || !cfg || !stm_uart) {
        return -EINVAL;
    }

    /* Configure baud rate */
    stm_uart->huart.Init.BaudRate = cfg->baud_rate;

    /* Configure data bits */
    switch (cfg->data_bits) {
        case DATA_BITS_8:
            stm_uart->huart.Init.WordLength = UART_WORDLENGTH_8B;
            break;
        case DATA_BITS_9:
            stm_uart->huart.Init.WordLength = UART_WORDLENGTH_9B;
            break;
        default:
            return -EINVAL;
    }

    /* Configure stop bits */
    switch (cfg->stop_bits) {
        case STOP_BITS_1:
            stm_uart->huart.Init.StopBits = UART_STOPBITS_1;
            break;
        case STOP_BITS_2:
            stm_uart->huart.Init.StopBits = UART_STOPBITS_2;
            break;
        default:
            return -EINVAL;
    }

    /* Configure parity */
    switch (cfg->parity) {
        case PARITY_NONE:
            stm_uart->huart.Init.Parity = UART_PARITY_NONE;
            break;
        case PARITY_ODD:
            stm_uart->huart.Init.Parity = UART_PARITY_ODD;
            break;
        case PARITY_EVEN:
            stm_uart->huart.Init.Parity = UART_PARITY_EVEN;
            break;
        default:
            return -EINVAL;
    }

    /* Configure flow control */
    if (cfg->flowcontrol == SERIAL_FLOWCONTROL_CTSRTS) {
        stm_uart->huart.Init.HwFlowCtl = UART_HWCONTROL_RTS_CTS;
    } else {
        stm_uart->huart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    }

    /* Apply configuration */
    if (HAL_UART_Init(&stm_uart->huart) != HAL_OK) {
        return -EIO;
    }

    return 0;
}

static inline void stm32_uart_rx_dma_config(struct stm32_uart *uartHandle)
{
    /* DMA RX配置 */
    uartHandle->hdma_uart_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    uartHandle->hdma_uart_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    uartHandle->hdma_uart_rx.Init.MemInc = DMA_MINC_ENABLE;
    uartHandle->hdma_uart_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uartHandle->hdma_uart_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uartHandle->hdma_uart_rx.Init.Mode = DMA_NORMAL;
    uartHandle->hdma_uart_rx.Init.Priority = DMA_PRIORITY_VERY_HIGH;

    if (HAL_DMA_Init(&uartHandle->hdma_uart_rx) != HAL_OK) {
        LOG_E("HAL_DMA_Init errno");
        while(1);
    }
    __HAL_LINKDMA(&uartHandle->huart, hdmarx, uartHandle->hdma_uart_rx);
}

static inline void stm32_uart_tx_dma_config(struct stm32_uart *uartHandle)
{
    /* DMA TX配置 */
    uartHandle->hdma_uart_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    uartHandle->hdma_uart_tx.Init.PeriphInc = DMA_PINC_DISABLE;
    uartHandle->hdma_uart_tx.Init.MemInc = DMA_MINC_ENABLE;
    uartHandle->hdma_uart_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uartHandle->hdma_uart_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uartHandle->hdma_uart_tx.Init.Mode = DMA_NORMAL;
    uartHandle->hdma_uart_tx.Init.Priority = DMA_PRIORITY_VERY_HIGH;

    if (HAL_DMA_Init(&uartHandle->hdma_uart_tx) != HAL_OK) {
        LOG_E("HAL_DMA_Init errno");
        while(1);
    }
    __HAL_LINKDMA(&uartHandle->huart, hdmatx, uartHandle->hdma_uart_tx);
}

/**
 * @brief 配置DMA
 * @param uartHandle: UART句柄
 * @param uart_index: UART索引
 * @retval None
 */
static void stm32_uart_dma_config(struct stm32_uart *uartHandle)
{
    /* DMA controller clock enable */
#if defined(STM32G4) || defined(STM32H7)
    __HAL_RCC_DMAMUX1_CLK_ENABLE();
#endif
    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_RCC_DMA2_CLK_ENABLE();

    switch (uartHandle->index) {
#ifdef BSP_USING_UART1
    case UART1_INDEX:
#ifdef BSP_UART1_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART1_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_USART1_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART1_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART1_DMA_RX_IRQn);
#endif
#ifdef BSP_UART1_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART1_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_USART1_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART1_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART1_DMA_TX_IRQn);
#endif
        break;
#endif

