zhengjy926/bsp/stm32/hal/bsp_usart.c
#if defined(BSP_USING_UART5)
    stm_uart_drv[UART5_INDEX].rx_cache_buf = uart5_rx_cache_buf;
    stm_uart_drv[UART5_INDEX].rx_cache_bufsz = sizeof(uart5_rx_cache_buf);
    serial_dev[UART5_INDEX].rx_buf   = uart5_rx_buf;
    serial_dev[UART5_INDEX].rx_bufsz = sizeof(uart5_rx_buf);
    serial_dev[UART5_INDEX].tx_buf   = uart5_tx_buf;
    serial_dev[UART5_INDEX].tx_bufsz = sizeof(uart5_tx_buf);
#endif

#if defined(BSP_USING_UART6)
    stm_uart_drv[UART6_INDEX].rx_cache_buf = uart6_rx_cache_buf;
    stm_uart_drv[UART6_INDEX].rx_cache_bufsz = sizeof(uart6_rx_cache_buf);
    serial_dev[UART6_INDEX].rx_buf   = uart6_rx_buf;
    serial_dev[UART6_INDEX].rx_bufsz = sizeof(uart6_rx_buf);
    serial_dev[UART6_INDEX].tx_buf   = uart6_tx_buf;
    serial_dev[UART6_INDEX].tx_bufsz = sizeof(uart6_tx_buf);
#endif

#if defined(BSP_USING_UART7)
    stm_uart_drv[UART7_INDEX].rx_cache_buf = uart7_rx_cache_buf;
    stm_uart_drv[UART7_INDEX].rx_cache_bufsz = sizeof(uart7_rx_cache_buf);
    serial_dev[UART7_INDEX].rx_buf   = uart7_rx_buf;
    serial_dev[UART7_INDEX].rx_bufsz = sizeof(uart7_rx_buf);
    serial_dev[UART7_INDEX].tx_buf   = uart7_tx_buf;
    serial_dev[UART7_INDEX].tx_bufsz = sizeof(uart7_tx_buf);
#endif

#if defined(BSP_USING_UART8)
    stm_uart_drv[UART8_INDEX].rx_cache_buf = uart8_rx_cache_buf;
    stm_uart_drv[UART8_INDEX].rx_cache_bufsz = sizeof(uart8_rx_cache_buf);
    serial_dev[UART8_INDEX].rx_buf   = uart8_rx_buf;
    serial_dev[UART8_INDEX].rx_bufsz = sizeof(uart8_rx_buf);
    serial_dev[UART8_INDEX].tx_buf   = uart8_tx_buf;
    serial_dev[UART8_INDEX].tx_bufsz = sizeof(uart8_tx_buf);
#endif

#if defined(BSP_USING_LPUART1)
    stm_uart_drv[LPUART1_INDEX].rx_cache_buf = lpuart1_rx_cache_buf;
    stm_uart_drv[LPUART1_INDEX].rx_cache_bufsz = sizeof(lpuart1_rx_cache_buf);
    serial_dev[LPUART1_INDEX].rx_buf   = lpuart1_rx_buf;
    serial_dev[LPUART1_INDEX].rx_bufsz = sizeof(lpuart1_rx_buf);
    serial_dev[LPUART1_INDEX].tx_buf   = lpuart1_tx_buf;
    serial_dev[LPUART1_INDEX].tx_bufsz = sizeof(lpuart1_tx_buf);
#endif

    return 0;
}

/* HAL Callback Functions ----------------------------------------------------*/
/**
  * @brief  Tx Transfer completed callback
  * @param  huart: Pointer to UART handle
  * @retval None
  */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    struct stm32_uart *stm_uart = container_of(huart, struct stm32_uart, huart);
    serial_t *port = &serial_dev[stm_uart->index];
    if (port) {
        hw_serial_tx_done_isr(port);
    }
}

/**
  * @brief  Reception Event Callback for DMA mode
  * @param  huart: UART handle
  * @param  Size: Number of data available in application reception buffer
  * @retval None
  */
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size)
{
    struct stm32_uart *stm_uart = container_of(huart, struct stm32_uart, huart);
    serial_t *port = &serial_dev[stm_uart->index];
    uint16_t process_size;

    if (!port) {
        return;
    }

    if (huart->RxEventType == HAL_UART_RXEVENT_HT)
    {
        // 半满中断 - 处理前半部分数据
        process_size = Size - stm_uart->last_pos;  // 计算需要处理的数据量
        if (process_size > 0) {
            hw_serial_rx_done_isr(port, stm_uart->rx_cache_buf + stm_uart->last_pos, process_size);
            stm_uart->last_pos = Size;  // 更新已处理位置
        }
    }
    else if (huart->RxEventType == HAL_UART_RXEVENT_TC ||
             huart->RxEventType == HAL_UART_RXEVENT_IDLE)
    {
        // 传输完成或空闲中断 - 处理剩余数据
        process_size = Size - stm_uart->last_pos;  // 计算剩余的数据量
        if (process_size > 0) {
            hw_serial_rx_done_isr(port, stm_uart->rx_cache_buf + stm_uart->last_pos, process_size);
        }

        // 重置位置计数器并重新启动接收
        stm_uart->last_pos = 0;
        stm32_uart_start_rx(port);
    }
}

/**
  * @brief  UART error callback.
  * @param  huart UART handle.
  * @retval None
  */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    struct stm32_uart *stm_uart = container_of(huart, struct stm32_uart, huart);
    serial_t *port = &serial_dev[stm_uart->index];

    /* 重新启动接收 */
    stm32_uart_start_rx(port);
}

/* Interrupt Service Routines -----------------------------------------------*/
#if defined(BSP_USING_UART1)
    void USART1_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[UART1_INDEX].huart);
    }
#if defined(BSP_UART1_RX_USING_DMA)
    void UART1_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART1_INDEX].hdma_uart_rx);
    }
#endif // BSP_UART1_RX_USING_DMA
#if defined(BSP_UART1_TX_USING_DMA)
    void UART1_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART1_INDEX].hdma_uart_tx);
    }
#endif // BSP_UART1_TX_USING_DMA
#endif // BSP_USING_UART1


#if defined(BSP_USING_UART2)
    void USART2_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[UART2_INDEX].huart);
    }
#if defined(BSP_UART2_RX_USING_DMA)
    void UART2_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART2_INDEX].hdma_uart_rx);
    }
#endif // BSP_UART2_RX_USING_DMA
#if defined(BSP_UART2_TX_USING_DMA)
    void UART2_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART2_INDEX].hdma_uart_tx);
    }
#endif // BSP_UART2_TX_USING_DMA
#endif // BSP_USING_UART2

#if defined(BSP_USING_UART3)
    void USART3_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[UART3_INDEX].huart);
    }
#if defined(BSP_UART3_RX_USING_DMA)
    void UART3_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART3_INDEX].hdma_uart_rx);
    }
#endif // BSP_UART3_RX_USING_DMA
#if defined(BSP_UART3_TX_USING_DMA)
    void UART3_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART3_INDEX].hdma_uart_tx);
    }
#endif // BSP_UART3_TX_USING_DMA
#endif // BSP_USING_UART3

#if defined(BSP_USING_UART4)
    void UART4_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[UART4_INDEX].huart);
    }
#if defined(BSP_UART4_RX_USING_DMA)
    void UART4_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART4_INDEX].hdma_uart_rx);
    }
#endif // BSP_UART4_RX_USING_DMA
#if defined(BSP_UART4_TX_USING_DMA)
    void UART4_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART4_INDEX].hdma_uart_tx);
    }
#endif // BSP_UART4_TX_USING_DMA
#endif // BSP_USING_UART4

